/// long-lat
List<Map<String, dynamic>> kCities = [
  {
    "name": "Adana",
    "coordinates": [35.63885116577154, 37.502420425415124]
  },
  {
    "name": "Adıyaman",
    "coordinates": [38.33137893676766, 37.818777084350614]
  },
  {
    "name": "Afyon",
    "coordinates": [30.686235427856616, 38.52266883850098]
  },
  {
    "name": "Ağrı",
    "coordinates": [43.3758354187014, 39.522737503051815]
  },
  {
    "name": "Aksaray",
    "coordinates": [33.81730842590338, 38.47033309936529]
  },
  {
    "name": "Amasya",
    "coordinates": [35.748954772949304, 40.64015960693362]
  },
  {
    "name": "Ankara",
    "coordinates": [32.410367012023954, 39.6703643798829]
  },
  {
    "name": "Antalya",
    "coordinates": [30.95719718933117, 36.7582359313966]
  },
  {
    "name": "Ardahan",
    "coordinates": [42.806522369384936, 41.11906051635739]
  },
  {
    "name": "Artvin",
    "coordinates": [41.852766036987276, 41.044666290283175]
  },
  {
    "name": "Aydın",
    "coordinates": [27.939164161682328, 37.71646690368655]
  },
  {
    "name": "Balıkesir",
    "coordinates": [27.7440834045411, 39.85543632507344]
  },
  {
    "name": "Bartın",
    "coordinates": [32.47552299499512, 41.536464691162166]
  },
  {
    "name": "Batman",
    "coordinates": [41.453506469726534, 38.048416137695284]
  },
  {
    "name": "Bayburt",
    "coordinates": [40.2441425323488, 40.23321533203125]
  },
  {
    "name": "Bilecik",
    "coordinates": [30.20188045501709, 40.10684394836437]
  },
  {
    "name": "Bingöl",
    "coordinates": [40.64213371276867, 39.02019691467294]
  },
  {
    "name": "Bitlis",
    "coordinates": [42.36004638671881, 38.55448722839378]
  },
  {
    "name": "Bolu",
    "coordinates": [31.568005561828727, 40.59153366088867]
  },
  {
    "name": "Burdur",
    "coordinates": [30.15182685852062, 37.37944984436041]
  },
  {
    "name": "Bursa",
    "coordinates": [29.032504081726103, 40.078512191772575]
  },
  {
    "name": "Çanakkale",
    "coordinates": [26.622932434082003, 40.1274871826173]
  },
  {
    "name": "Çankırı",
    "coordinates": [33.330326080322436, 40.678222656250114]
  },
  {
    "name": "Çorum",
    "coordinates": [34.71375465393072, 40.605691909790124]
  },
  {
    "name": "Denizli",
    "coordinates": [29.296125411987475, 37.66773414611822]
  },
  {
    "name": "Diyarbakır",
    "coordinates": [40.27259445190447, 38.14095687866211]
  },
  {
    "name": "Düzce",
    "coordinates": [31.315496444702205, 40.89132690429685]
  },
  {
    "name": "Edirne",
    "coordinates": [26.50543212890659, 41.29810523986822]
  },
  {
    "name": "Elazığ",
    "coordinates": [39.37353324890154, 38.76781082153329]
  },
  {
    "name": "Erzincan",
    "coordinates": [39.520299911499194, 39.537231445312585]
  },
  {
    "name": "Erzurum",
    "coordinates": [41.406341552734546, 40.072561264038086]
  },
  {
    "name": "Eskişehir",
    "coordinates": [31.006031990051497, 39.624460220336914]
  },
  {
    "name": "Gaziantep",
    "coordinates": [37.24704933166515, 37.100490570068445]
  },
  {
    "name": "Giresun",
    "coordinates": [38.593667984008846, 40.563781738281364]
  },
  {
    "name": "Gümüşhane",
    "coordinates": [39.478937149048136, 40.32445907592796]
  },
  {
    "name": "Hakkari",
    "coordinates": [44.13520622253424, 37.36799430847179]
  },
  {
    "name": "Hatay",
    "coordinates": [36.242595672607536, 36.42049026489272]
  },
  {
    "name": "Iğdır",
    "coordinates": [44.0566806793214, 39.921939849853686]
  },
  {
    "name": "Isparta",
    "coordinates": [30.809888839721822, 37.92969703674322]
  },
  {
    "name": "İstanbul",
    "coordinates": [28.970165252685575, 41.181804656982564]
  },
  {
    "name": "İzmir",
    "coordinates": [27.38393115997343, 38.65636062622082]
  },
  {
    "name": "Kahramanmaraş",
    "coordinates": [36.99332046508809, 37.92292404174805]
  },
  {
    "name": "Karabük",
    "coordinates": [32.58456802368181, 41.19659042358404]
  },
  {
    "name": "Karaman",
    "coordinates": [33.32705497741716, 37.01968574523934]
  },
  {
    "name": "Kars",
    "coordinates": [42.94409751892093, 40.560007095337]
  },
  {
    "name": "Kastamonu",
    "coordinates": [33.64013481140148, 41.435693740844755]
  },
  {
    "name": "Kayseri",
    "coordinates": [35.92643356323259, 38.609514236450195]
  },
  {
    "name": "Kilis",
    "coordinates": [37.145195007324446, 36.81706237792977]
  },
  {
    "name": "Kırıkkale",
    "coordinates": [33.71596717834473, 39.722934722900504]
  },
  {
    "name": "Kırklareli",
    "coordinates": [27.515642166137894, 41.663278579712056]
  },
  {
    "name": "Kırşehir",
    "coordinates": [34.14129447937029, 39.30101966857916]
  },
  {
    "name": "Kocaeli",
    "coordinates": [29.81586551666257, 40.88640594482433]
  },
  {
    "name": "Konya",
    "coordinates": [32.879172325134505, 38.01397705078119]
  },
  {
    "name": "Kütahya",
    "coordinates": [29.557352066040124, 39.3171253204348]
  },
  {
    "name": "Malatya",
    "coordinates": [38.16857337951677, 38.47357940673845]
  },
  {
    "name": "Manisa",
    "coordinates": [28.080514907837113, 38.7565593719483]
  },
  {
    "name": "Mardin",
    "coordinates": [40.91935539245608, 37.351905822753935]
  },
  {
    "name": "Mersin",
    "coordinates": [33.81791877746585, 36.70570945739763]
  },
  {
    "name": "Muğla",
    "coordinates": [28.428680419922074, 36.94393348693865]
  },
  {
    "name": "Muş",
    "coordinates": [41.96273803710949, 39.00590133666998]
  },
  {
    "name": "Nevşehir",
    "coordinates": [34.63831138610837, 38.919353485107536]
  },
  {
    "name": "Niğde",
    "coordinates": [34.71892547607436, 37.894121170043974]
  },
  {
    "name": "Ordu",
    "coordinates": [37.422216415405444, 40.738958358764705]
  },
  {
    "name": "Osmaniye",
    "coordinates": [36.29073333740243, 37.302267074585075]
  },
  {
    "name": "Rize",
    "coordinates": [40.879421234130945, 40.91517257690427]
  },
  {
    "name": "Sakarya",
    "coordinates": [30.480576515197924, 40.7572422027589]
  },
  {
    "name": "Samsun",
    "coordinates": [36.02231788635257, 41.289133071899556]
  },
  {
    "name": "Şanlıurfa",
    "coordinates": [39.042755126953324, 37.347826004028406]
  },
  {
    "name": "Siirt",
    "coordinates": [42.2251892089844, 37.94938087463379]
  },
  {
    "name": "Sinop",
    "coordinates": [34.8622474670413, 41.6468639373779]
  },
  {
    "name": "Şırnak",
    "coordinates": [42.61998748779314, 37.49352073669439]
  },
  {
    "name": "Sivas",
    "coordinates": [37.29318428039562, 39.54344177246105]
  },
  {
    "name": "Tekirdağ",
    "coordinates": [27.481228828430403, 41.085605621337976]
  },
  {
    "name": "Tokat",
    "coordinates": [36.579967498779354, 40.422643661499194]
  },
  {
    "name": "Trabzon",
    "coordinates": [39.81492042541515, 40.804204940795984]
  },
  {
    "name": "Tunceli",
    "coordinates": [39.63505172729501, 39.1528835296632]
  },
  {
    "name": "Uşak",
    "coordinates": [29.35989761352556, 38.540870666503935]
  },
  {
    "name": "Van",
    "coordinates": [43.631252288818445, 38.51478767395025]
  },
  {
    "name": "Yalova",
    "coordinates": [29.111382484436206, 40.578889846801786]
  },
  {
    "name": "Yozgat",
    "coordinates": [35.10550689697283, 39.61728096008309]
  },
  {
    "name": "Zonguldak",
    "coordinates": [31.84611606597906, 41.290641784668026]
  }
];
